tap "armmbed/formulae"
tap "earthly/earthly"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "stripe/stripe-cli"
tap "tinygo-org/tools"
brew "m4"
brew "autoconf"
brew "readline"
brew "xz"
brew "python@3.11"
brew "autopep8"
brew "avrdude"
brew "glib"
brew "python@3.9"
brew "cairo"
brew "harfbuzz"
brew "ballerina"
brew "python@3.10"
brew "bandit"
brew "node"
brew "bash-language-server"
brew "ghc"
brew "cabal-install"
brew "cmake"
brew "guile"
brew "libidn2"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "qemu"
brew "lima"
brew "colima"
brew "coreutils"
brew "libssh2"
brew "openldap"
brew "curl"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "dotenv-linter"
brew "folly"
brew "edencommon"
brew "exercism"
brew "exiftool"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "libarchive"
brew "libass"
brew "libbluray"
brew "srt"
brew "ffmpeg"
brew "findutils"
brew "gdk-pixbuf"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "gradle"
brew "gsl"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "icdiff"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "krb5"
brew "ldns"
brew "libfido2"
brew "libgit2"
brew "libpq"
brew "llvm"
brew "llvm@14"
brew "mackup"
brew "make"
brew "mas"
brew "minicom"
brew "moreutils"
brew "neofetch"
brew "nghttp2"
brew "nginx"
brew "ninja"
brew "nvm"
brew "openssl@3"
brew "tcl-tk"
brew "pillow"
brew "pipenv"
brew "podman"
brew "postgresql@14", restart_service: true
brew "pyenv"
brew "pyenv-virtualenvwrapper"
brew "r"
brew "rustup-init"
brew "shellcheck"
brew "spaceship"
brew "speedtest-cli"
brew "starship"
brew "stress"
brew "strongswan"
brew "telnet"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "transmission-cli"
brew "watch"
brew "watchman"
brew "zlib"
brew "armmbed/formulae/arm-none-eabi-gcc", link: false
brew "earthly/earthly/earthly"
brew "heroku/brew/heroku"
brew "osx-cross/arm/arm-gcc-bin@10"
brew "osx-cross/avr/avr-gcc@9"
brew "qmk/qmk/qmk"
brew "stripe/stripe-cli/stripe"
cask "1password-beta"
cask "1password-cli-beta"
cask "android-file-transfer"
cask "android-platform-tools"
cask "android-studio"
cask "appcleaner"
cask "arduino"
cask "balenaetcher"
cask "bartender"
cask "bettertouchtool"
cask "blockblock"
cask "cheatsheet"
cask "dbeaver-community"
cask "dotnet-sdk"
cask "emacs"
cask "firefox-developer-edition"
cask "fork"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "insomnia"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "knockknock"
cask "linear-linear"
cask "microsoft-remote-desktop"
cask "min"
cask "mongodb-compass"
cask "monitorcontrol"
cask "moonlight"
cask "ngrok"
cask "notion"
cask "numi"
cask "obs"
cask "parallels"
cask "plex"
cask "pop"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "qmk-toolbox"
cask "quicklook-json"
cask "quicklookase"
cask "rectangle"
cask "signal"
cask "simplenote"
cask "slack"
cask "stats"
cask "steam"
cask "steermouse"
cask "streamlabs-obs"
cask "tailscale"
cask "temurin"
cask "temurin11"
cask "thonny"
cask "topnotch"
cask "transmission"
cask "tunnelblick"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Decompressor", id: 1033480833
mas "Disk Speed Test", id: 425264550
mas "Free Ruler", id: 1483172210
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "iHosts", id: 1102004240
mas "Keynote", id: 409183694
mas "Markoff", id: 1084713122
mas "Messenger", id: 1480068668
mas "Microsoft OneNote", id: 784801555
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "UpNote", id: 1398373917
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
