tap "armmbed/formulae"
tap "chiselstrike/tap"
tap "codecrafters-io/tap"
tap "dart-lang/dart"
tap "earthly/earthly"
tap "go-swagger/go-swagger"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "planetscale/tap"
tap "qmk/qmk"
tap "sdkman/tap"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"
tap "tinygo-org/tools"
brew "xz"
brew "webp"
brew "jpeg-xl"
brew "grpc"
brew "apache-arrow"
brew "arduino-cli"
brew "gcc"
brew "open-mpi"
brew "arpack"
brew "m4"
brew "autoconf"
brew "readline"
brew "autopep8"
brew "boost"
brew "avrdude"
brew "pycparser"
brew "cffi"
brew "docutils"
brew "python@3.11"
brew "awscli"
brew "glib"
brew "cairo"
brew "harfbuzz"
brew "openjdk"
brew "ballerina"
brew "bandit"
brew "node"
brew "bash-language-server"
brew "buildifier"
brew "ghc"
brew "cabal-install"
brew "cgal"
brew "chamber"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "libidn2"
brew "libssh2"
brew "curl"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "dotenv-linter"
brew "drone-cli"
brew "folly"
brew "edencommon"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs", restart_service: true
brew "exercism"
brew "exiftool"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "openssl@1.1"
brew "netpbm"
brew "findutils"
brew "flyctl"
brew "fnm"
brew "fzf"
brew "shared-mime-info"
brew "libheif"
brew "libpq"
brew "libspatialite"
brew "numpy"
brew "poppler"
brew "gdal"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "gitui"
brew "qt"
brew "gnuplot"
brew "go"
brew "go-jsonnet"
brew "gobject-introspection"
brew "golangci-lint"
brew "gradle"
brew "librsvg"
brew "graphviz"
brew "grpc@1.54"
brew "gsl"
brew "guile"
brew "helix"
brew "ncurses"
brew "htop"
brew "hyperfine"
brew "icdiff"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "ldns"
brew "libfido2"
brew "libgit2"
brew "libzip"
brew "qemu"
brew "lima"
brew "llvm"
brew "llvm@12"
brew "macchina"
brew "mackup"
brew "mage"
brew "make"
brew "mas"
brew "mimirtool"
brew "minicom"
brew "minikube"
brew "moreutils"
brew "mysql", restart_service: true
brew "mysql-client"
brew "neovim"
brew "nghttp2"
brew "nginx", restart_service: true
brew "ninja"
brew "qscintilla2"
brew "suite-sparse"
brew "sundials"
brew "octave"
brew "openjdk@11"
brew "openjdk@17"
brew "virtualenv"
brew "pdm"
brew "tcl-tk"
brew "pillow"
brew "pinentry-mac"
brew "pipenv"
brew "poetry"
brew "postgresql@14", restart_service: true
brew "py3cairo"
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "r"
brew "rustup-init"
brew "scipy"
brew "shellcheck"
brew "sox"
brew "spaceship"
brew "starship"
brew "stress"
brew "strongswan"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "transmission-cli"
brew "vercel-cli"
brew "watch"
brew "watchman"
brew "yarn"
brew "youtube-dl"
brew "yq"
brew "zellij"
brew "zig"
brew "armmbed/formulae/arm-none-eabi-gcc", link: false
brew "chiselstrike/tap/turso"
brew "codecrafters-io/tap/codecrafters"
brew "dart-lang/dart/dart"
brew "earthly/earthly/earthly"
brew "go-swagger/go-swagger/go-swagger"
brew "osx-cross/arm/arm-gcc-bin@10"
brew "osx-cross/avr/avr-gcc@8"
brew "osx-cross/avr/avr-gcc@9"
brew "planetscale/tap/pscale"
brew "sdkman/tap/sdkman-cli"
brew "stripe/stripe-cli/stripe"
brew "teamookla/speedtest/speedtest"
brew "tinygo-org/tools/tinygo"
cask "1password-beta"
cask "1password-cli-beta"
cask "android-file-transfer"
cask "android-platform-tools"
cask "appcleaner"
cask "arc"
cask "arduino-ide"
cask "balenaetcher"
cask "bartender"
cask "blockblock"
cask "cinebench"
cask "coolterm"
cask "curseforge"
cask "discord"
cask "drawio"
cask "element"
cask "firefox-developer-edition"
cask "fluor"
cask "fork"
cask "geekbench"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite-no-mail"
cask "grandperspective"
cask "hex-fiend"
cask "httpie"
cask "hyperkey"
cask "iterm2"
cask "itsycal"
cask "jasper"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "kitty"
cask "knockknock"
cask "krita"
cask "lapce"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "minecraft"
cask "mongodb-compass"
cask "monitorcontrol"
cask "multimc"
cask "multitouch"
cask "netspot"
cask "ngrok"
cask "numi"
cask "obs"
cask "onyx"
cask "openemu"
cask "orbstack"
cask "plex"
cask "plexamp"
cask "pocket-casts"
cask "pop"
cask "postman"
cask "qlmarkdown"
cask "qlvideo"
cask "qmk-toolbox"
cask "rectangle"
cask "signal"
cask "silicon-info"
cask "slack"
cask "stats"
cask "steam"
cask "steelseries-engine"
cask "steermouse"
cask "syntax-highlight"
cask "tableplus"
cask "tailscale"
cask "transmission"
cask "tunnelblick"
cask "tuple"
cask "unity-hub"
cask "utm"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "vlc"
cask "webpquicklook"
cask "wireshark"
cask "zed"
cask "zoom"
mas "AmorphousDiskMark", id: 1168254295
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Decompressor", id: 1033480833
mas "Disk Speed Test", id: 425264550
mas "Free Ruler", id: 1483172210
mas "Gifski", id: 1351639930
mas "iHosts", id: 1102004240
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Markoff", id: 1084713122
mas "Messenger", id: 1480068668
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "ScreenBrush", id: 1233965871
mas "UpNote", id: 1398373917
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "13xforever.language-x86-64-assembly"
vscode "adpyke.codesnap"
vscode "adrianwilczynski.alpine-js-intellisense"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "arcanis.vscode-zipfs"
vscode "artdiniz.quitcontrol-vscode"
vscode "astro-build.astro-vscode"
vscode "batisteo.vscode-django"
vscode "BazelBuild.vscode-bazel"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmalehorn.shell-syntax"
vscode "bmalehorn.vscode-fish"
vscode "bradlc.vscode-tailwindcss"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "craigb85.custom-window-zoom"
vscode "csstools.postcss"
vscode "dan-c-underwood.arm"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dotenv.dotenv-vscode"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "earthly.earthfile-syntax-highlighting"
vscode "EditorConfig.EditorConfig"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "file-icons.file-icons"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "fredwangwang.vscode-hcl-format"
vscode "fwcd.kotlin"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "GitLab.gitlab-workflow"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "Grafana.vscode-jsonnet"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "IBM.output-colorizer"
vscode "jasonnutter.vscode-codeowners"
vscode "jedeop.crates-completer"
vscode "joedevivo.vscode-circuitpython"
vscode "karenpommeroy.batch-rename"
vscode "karyfoundation.nearley"
vscode "KevinRose.vsc-python-indent"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mattn.Lisp"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "monosans.djlint"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ngtystr.ppm-pgm-viewer-for-vscode"
vscode "nickgo.cuelang"
vscode "Orta.vscode-jest"
vscode "pedro-w.tmlanguage"
vscode "pest.pest-ide-tools"
vscode "Prisma.prisma"
vscode "redhat.ansible"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "shanoor.vscode-nginx"
vscode "Shopify.ruby-lsp"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sswg.swift-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tinygo.vscode-tinygo"
vscode "toasty-technologies.octave"
vscode "trond-snekvik.simple-rst"
vscode "twxs.cmake"
vscode "Tyriar.sort-lines"
vscode "ultram4rine.vscode-choosealicense"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "wholroyd.jinja"
vscode "Wokwi.wokwi-vscode"
vscode "xaver.clang-format"
vscode "zhuangtongfa.material-theme"
vscode "ziglang.vscode-zig"
vscode "Zignd.html-css-class-completion"
vscode "ZixuanChen.vitest-explorer"
vscode "ziyasal.vscode-open-in-github"
vscode "zxh404.vscode-proto3"
