tap "armmbed/formulae"
tap "chiselstrike/tap"
tap "codecrafters-io/tap"
tap "dart-lang/dart"
tap "earthly/earthly"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "planetscale/tap"
tap "qmk/qmk"
tap "sdkman/tap"
tap "stripe/stripe-cli"
tap "tinygo-org/tools"
brew "xz"
brew "jpeg-xl"
brew "openssl@1.1"
brew "apache-arrow"
brew "arduino-cli"
brew "gcc"
brew "m4"
brew "autoconf"
brew "readline"
brew "python@3.11"
brew "autopep8"
brew "boost"
brew "avrdude"
brew "glib"
brew "cairo"
brew "harfbuzz"
brew "openjdk@11"
brew "ballerina"
brew "bandit"
brew "node"
brew "bash-language-server"
brew "llvm@12"
brew "ghc"
brew "cabal-install"
brew "chamber"
brew "cmake"
brew "libidn2"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "ncurses"
brew "qemu"
brew "lima"
brew "colima"
brew "coreutils"
brew "libssh2"
brew "openldap"
brew "curl"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "dotenv-linter"
brew "folly"
brew "edencommon"
brew "ghostscript"
brew "exercism"
brew "exiftool"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "libarchive"
brew "libass"
brew "libbluray"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "netpbm"
brew "findutils"
brew "flyctl"
brew "fzf"
brew "krb5"
brew "shared-mime-info"
brew "libheif"
brew "libpq"
brew "gdal"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "gitui"
brew "gnu-sed"
brew "go"
brew "gobject-introspection"
brew "openjdk@17"
brew "gradle"
brew "graphviz"
brew "gsl"
brew "guile"
brew "htop"
brew "httpie", link: false
brew "hyperfine"
brew "icdiff"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "ldns"
brew "libfido2"
brew "libgit2"
brew "llvm"
brew "macchina"
brew "mackup"
brew "make"
brew "mas"
brew "minicom"
brew "minikube"
brew "moreutils"
brew "zlib"
brew "mysql-client"
brew "neovim"
brew "nghttp2"
brew "nginx"
brew "ninja"
brew "nvm"
brew "octave"
brew "openjdk"
brew "openssl@3"
brew "pdm"
brew "tcl-tk"
brew "pillow"
brew "pipenv"
brew "podman"
brew "poetry"
brew "postgresql@14", restart_service: true
brew "postgis"
brew "postgresql@15"
brew "py3cairo"
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "r"
brew "rustup-init"
brew "scipy"
brew "shellcheck"
brew "sox"
brew "spaceship"
brew "speedtest-cli"
brew "starship"
brew "stress"
brew "strongswan"
brew "telnet"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "transmission-cli"
brew "vercel-cli"
brew "watch"
brew "watchman"
brew "yq"
brew "zellij"
brew "zig"
brew "armmbed/formulae/arm-none-eabi-gcc", link: false
brew "chiselstrike/tap/turso"
brew "codecrafters-io/tap/codecrafters"
brew "dart-lang/dart/dart"
brew "earthly/earthly/earthly"
brew "osx-cross/arm/arm-gcc-bin@10"
brew "osx-cross/avr/avr-gcc@8"
brew "osx-cross/avr/avr-gcc@9"
brew "planetscale/tap/pscale"
brew "sdkman/tap/sdkman-cli"
brew "stripe/stripe-cli/stripe"
brew "tinygo-org/tools/tinygo"
cask "1password-beta"
cask "1password-cli-beta"
cask "android-file-transfer"
cask "android-platform-tools"
cask "appcleaner"
cask "balenaetcher"
cask "bartender"
cask "blockblock"
cask "cinebench"
cask "coolterm"
cask "curseforge"
cask "discord"
cask "dotnet-sdk"
cask "drawio"
cask "element"
cask "firefox-developer-edition"
cask "fluor"
cask "fork"
cask "geekbench"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "grandperspective"
cask "hex-fiend"
cask "httpie"
cask "hyperkey"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "kitty"
cask "knockknock"
cask "krita"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "minecraft"
cask "mongodb-compass"
cask "monitorcontrol"
cask "mono-mdk"
cask "multimc"
cask "multitouch"
cask "ngrok"
cask "numi"
cask "obs"
cask "onyx"
cask "openemu"
cask "plex"
cask "plexamp"
cask "pocket-casts"
cask "podman-desktop"
cask "pop"
cask "postman"
cask "qlmarkdown"
cask "qlvideo"
cask "qmk-toolbox"
cask "rectangle"
cask "signal"
cask "silicon-info"
cask "slack"
cask "stats"
cask "steam"
cask "steelseries-engine"
cask "steermouse"
cask "syntax-highlight"
cask "tableplus"
cask "tailscale"
cask "transmission"
cask "tunnelblick"
cask "unity-hub"
cask "utm"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "vlc"
cask "webpquicklook"
cask "zoom"
mas "AmorphousDiskMark", id: 1168254295
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Decompressor", id: 1033480833
mas "Disk Speed Test", id: 425264550
mas "Free Ruler", id: 1483172210
mas "Gifski", id: 1351639930
mas "iHosts", id: 1102004240
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Markoff", id: 1084713122
mas "Messenger", id: 1480068668
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "ScreenBrush", id: 1233965871
mas "UpNote", id: 1398373917
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
